# CannotMoveHostedLoad Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LoadFailures..::..CannotMoveHostedLoad Property
BuiltInFailures..::..LoadFailures Class See Also
---
Can't move Load based on the Host Element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotMoveHostedLoad { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotMoveHostedLoad As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotMoveHostedLoad {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LoadFailures Class
Autodesk.Revit.DB Namespace